import 'package:flutter/cupertino.dart';
import 'package:oyna/model/one_of_four.dart';
import 'package:oyna/model/teaching_card.dart';

class Day {
  int day;
  List<OneOfFour> oneOfFours;
  Day({
    @required this.day,
    @required this.oneOfFours,
  });
}

List days = [
  Day(
    day: 1,
    oneOfFours: [
      OneOfFour(
        type: 'Грамматика',
        topic: 'Синоним, Антоним, Омоним',
        teachingCards: [
          TeachingCard(
            title: 'Антоним',
            text:
                'Мағыналары бір-біріне қарама-қарсы сөздер антонимдер деп аталады. Мысалы, елгезек бала-тілазар бала, шабан ат-жүрдек ат, іскер адам-олақ адам, жақсы мінез-жаман мінез, қисық ағаш-түзу ағаш, тату көрші- араз көрші, т.б. Тілімізде антоним сөздер мақал-мәтелдерде, жұмбақтарда көп кездеседі.',
          ),
          TeachingCard(
            title: 'Антоним',
            text:
                'Мысалы, Ащы мен тұщыны татқан білер, алыс пен жақынды жортқан білер. Аз сөз – алтын, көп сөз – көмір, т.б. Осы мысалдардағы ащы-тұщы, алыс-жақын, аз-көп сөздері – мағыналары бір-біріне қарама-қарсы айтылған антоним сөздер.',
          ),
          TeachingCard(
            title: 'Омоним',
            text:
                'Омоним – сыртқы тұлғасы: айтылуы, естілуі, жазылуы бірдей, мағыналары әртүрлі сөздер. Сыртқы тұлғасы жағынан омоним сөздер мен көп мағыналы сөздер ұқсас болып келеді. Омоним болудың негізгі белгісі сөздердің арасында мағыналық байланыс болмайды, яғни омоним сөздер әртүрлі мағынада қолданылады, ал көп мағыналы сөздердің арасында мағыналық байланыс болады, көп мағыналы сөздер бір сөз табынан болып, бір негізден тарайды.',
          ),
          TeachingCard(
            title: 'Омоним',
            text:
                'Мысалы, Басыңды жоғары көтеріп, аяғыңды жылдам бас деген сөйлемдегі бас сөзі омоним, себебі бірінші бас сөзі адамның дене мүшесі – не? деген сұраққа жауап беретін, заттық ұғым атауы болатын зат есім, екінші бас сөзі – не істе? деген сұраққа жауап беретін қимыл-әрекет атауы болатын етістік. Ал Талдың басына қарлығаш ұя салыпты. Жолаушылар бұлақтың басына келіп демалды деген сөйлемдердегі бас сөзі – көп мағыналы сөз, себебі. 1) бір нәрсенің бастау алатын жері деген бірдей мағынаға ие болып тұр; 2) екеуі де бір сөз табынан зат есім болып тұр.',
          ),
          TeachingCard(
            title: 'Омоним',
            text:
                'Омофон дегеніміз айтылуы бірдей, бірақ жазылуы әр түрлі сөздер. Егер омонимдер айтылуы да, жазылуы да бірдей, бірақ мағыналары басқа сөздер болып келсе, ал омофондар тек айтылуы бірдей болғанмен, шын мәнінде омоним емес сөздер, сондықтан олар жазуда әр түрлі таңбаланады. Тіл білімінде омофондардың шын мәнінде омонимдер еместігі ескеріліп, олар кейде жалған омонимдер, кейде сөздердің айтылуындағы ұқсастығына қарап фонетикалық омонимдер деп аталады. Мысалы: көнбе және көмбе.',
          ),
          TeachingCard(
            title: 'Синоним',
            text:
                'Айтылуы, естілуі, жазылуы әр алуан, мағыналары бір-біріне жақын, жуық мәнді сөздер синонимдер деп аталады. Синонимге тән негізгі белгілер: 1) синоним сөздер әртүрлі дыбысталады; 2) синоним сөздердің мағынасы бір-біріне жақын болып келеді; 3) синоним сөздер бір сөз табынан болады.',
          ),
          TeachingCard(
            title: 'Синоним',
            text:
                'Мысалы, Апатты аймаққа көмекші, жәрдемші топ келді деген сөйлемдегі көмекші, жәрдемші сөзі бірінің орнына бірін ауыстырып қолдануға болатын, мағыналары бір-біріне жақын, бір сөз табынан болған синоним сөздер. Тілімізде синоним сөздер зат есімдерден, сын есімдерден, етістіктерден және үстеулерден кездеседі. Синоним болып жұмсалатын мәндес сөздердің тобын синонимдік қатар немесе синонимдік ұя деп атайды.',
          ),
        ],
      ),
      OneOfFour(
        type: 'Практика - Оқылым',
        topic: 'Синоним, Антоним, Омоним',
        teachingCards: [],
      ),
      OneOfFour(
        type: 'Практика - Тыңдалым',
        topic: 'Синоним, Антоним, Омоним',
        teachingCards: [],
      ),
      OneOfFour(
        type: 'Практика - Жазылым',
        topic: 'Синоним, Антоним, Омоним',
        teachingCards: [],
      ),
    ],
  ),
];
